// Я люблю числа Фибоначчи в целом, но я должен признать, что люблю некоторые больше, чем другие.
//
//     Я хотел бы, чтобы вы написали мне функцию, которая при задании числа (n) возвращает n-е число в последовательности Фибоначчи.
//
//     Например:
// nthFibo(4) == 2
// Потому что 2 - 4-е число в последовательности Фибоначчи.
//
//     Для справки, первые два числа в последовательности Фибоначчи равны 0 и 1, и каждое последующее число является суммой предыдущих двух.

function nthFibo(n) {
    // Return the n-th number in the Fibonacci Sequence
}


//Чужое решение



document.getElementById("result").textContent = nthFibo(1);